In [1]:
#importing the libraries
import pandas as pd
import numpy as np

In [2]:
#importing the dataset
data_url = "https://bit.ly/smallstocks"
df = pd.read_csv(data_url)
df

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

## Multi-Level Indexing

In [3]:
# normal group by
g = df.groupby('Symbol')
g['Close'].mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [4]:
# multi index group by
g = df.groupby(['Symbol','Date'])
series = g['Close'].mean()
series

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [5]:
# indexing in multi-level index
series.loc['AAPL','2016-10-03']

112.52

In [6]:
# multi- level indexed series is similar to a normal dataframe
series.unstack() # this will convert the 2 indexed series into a normal dataframe

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

## Pivot Table

The same thing can be done with a pivot table. The default aggregation method for pivot table is mean()

*Side Note :*
**Pivot** is similar to pivot table. but, the index may contain only unique values

In [7]:
pt = pd.pivot_table(df,index='Symbol',columns='Date',values='Close')
pt

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [8]:
# indexing the resultant dataframe
pt.loc['AAPL','2016-10-04']

113.0

In [9]:
# dataframe to multi indexed series
pt.stack()

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
dtype: float64

## Multi Indexed DataFrame

In [10]:
mdf = df.set_index(['Date','Symbol'])
mdf

                    Close    Volume
Date       Symbol
2016-10-03 CSCO     31.50  14070500
           AAPL    112.52  21701800
           MSFT     57.42  19189500
2016-10-04 AAPL    113.00  29736800
           MSFT     57.24  20085900
           CSCO     31.35  18460400
2016-10-05 MSFT     57.64  16726400
           CSCO     31.59  11808600
           AAPL    113.05  21453100

In [12]:
# indexing in multi indexed dataframe
mdf.loc[('2016-10-03','CSCO'),'Volume']

14070500.0